In [3]:
import pandas as pd

In [4]:
var = pd.DataFrame({"name":["a","b","c","d","a","b","a","a","a","a","b","b","c","d","a","b"]
                    ,"sub_1":[11,12,13,33,44,55,55,33,44,45,59,20,40,90,85,87],
                    "sub_2":[11,12,14,33,22,55,92,33,44,56,59,19,98,89,85,50]})

In [5]:
var

   name  sub_1  sub_2
0     a     11     11
1     b     12     12
2     c     13     14
3     d     33     33
4     a     44     22
5     b     55     55
6     a     55     92
7     a     33     33
8     a     44     44
9     a     45     56
10    b     59     59
11    b     20     19
12    c     40     98
13    d     90     89
14    a     85     85
15    b     87     50

In [6]:
var_New = var.groupby("name")

In [7]:
var_New

In [10]:
for x,y in var_New:
    print(x)
    print(y)
    print()

a
   name  sub_1  sub_2
0     a     11     11
4     a     44     22
6     a     55     92
7     a     33     33
8     a     44     44
9     a     45     56
14    a     85     85

b
   name  sub_1  sub_2
1     b     12     12
5     b     55     55
10    b     59     59
11    b     20     19
15    b     87     50

c
   name  sub_1  sub_2
2     c     13     14
12    c     40     98

d
   name  sub_1  sub_2
3     d     33     33
13    d     90     89

In [15]:
var2 = var_New.get_group("a")

In [16]:
var2

   name  sub_1  sub_2
0     a     11     11
4     a     44     22
6     a     55     92
7     a     33     33
8     a     44     44
9     a     45     56
14    a     85     85

In [17]:
# for minium data
var3 = var_New.min()

In [18]:
var3

      sub_1  sub_2
name
a        11     11
b        12     12
c        13     14
d        33     33

In [19]:
var4 = var_New.max()

In [20]:
var4

      sub_1  sub_2
name
a        85     92
b        87     59
c        40     98
d        90     89

In [21]:
var5 = var_New.mean()

In [22]:
var5

          sub_1  sub_2
name
a     45.285714   49.0
b     46.600000   39.0
c     26.500000   56.0
d     61.500000   61.0

In [23]:
li = list(var_New)

In [24]:
li

[('a',
     name  sub_1  sub_2
  0     a     11     11
  4     a     44     22
  6     a     55     92
  7     a     33     33
  8     a     44     44
  9     a     45     56
  14    a     85     85),
 ('b',
     name  sub_1  sub_2
  1     b     12     12
  5     b     55     55
  10    b     59     59
  11    b     20     19
  15    b     87     50),
 ('c',
     name  sub_1  sub_2
  2     c     13     14
  12    c     40     98),
 ('d',
     name  sub_1  sub_2
  3     d     33     33
  13    d     90     89)]